[
  {
    "name": "Atkins Diet",
    "image": "atkins-diet.jpg",
    "summary": "The Atkins Diet is a low-carbohydrate eating plan developed by Dr. Robert Atkins in the 1960s. It emphasizes reducing carbohydrate intake to encourage the body to burn stored fat for energy, leading to weight loss. The diet progresses through four phases, gradually increasing carb intake while monitoring weight loss and maintenance. Critics have raised concerns about its high saturated fat content and potential nutrient deficiencies due to limited fruit and grain consumption. Despite this, many have found success with the Atkins approach to weight management.",
    "peak_search_trend": "2004-01",
    "main_foods": [
      "Beef",
      "Pork",
      "Poultry",
      "Fish",
      "Cheese",
      "Eggs",
      "Leafy greens",
      "Berries",
      "Nuts"
    ],
    "filter_value": "Atkins Diet"
  },
  {
    "name": "Gluten-Free Diet",
    "image": "gluten-free-diet.png",
    "summary": "A gluten-free diet eliminates all foods containing gluten, a protein found in wheat, barley, rye, and their derivatives. This diet is essential for individuals with celiac disease or gluten sensitivity to prevent adverse health effects. Adopting a gluten-free lifestyle involves careful selection of foods and reading labels to avoid hidden sources of gluten. Naturally gluten-free foods like fruits, vegetables, meat, and dairy are emphasized. While some adopt it for weight loss, long-term gluten-free eating requires nutritional mindfulness.",
    "peak_search_trend": "2013-08",
    "main_foods": [
      "Rice",
      "Quinoa",
      "Corn",
      "Potatoes",
      "Legumes",
      "Fruits",
      "Vegetables",
      "Meat",
      "Fish",
      "Dairy"
    ],
    "filter_value": "Gluten Free Diet"
  },
  {
    "name": "Grapefruit Diet",
    "image": "grapefruit-diet.jpg",
    "summary": "The Grapefruit Diet, also known as the Hollywood Diet, is a short-term weight loss plan that dates back to the 1930s. It involves consuming grapefruit or grapefruit juice with every meal, based on the belief that grapefruit has fat-burning enzymes. The diet typically restricts daily calorie intake to around 800–1,000 calories and emphasizes high-protein foods. While some individuals report quick weight loss, health experts caution that such restrictive diets can lead to nutrient deficiencies and are not sustainable long-term solutions for weight management.",
    "peak_search_trend": "2004-02",
    "main_foods": [
      "Grapefruit",
      "Eggs",
      "Lean meat",
      "Fish",
      "Vegetables",
      "Coffee"
    ],
    "filter_value": "Grapefruit Diet"
  },
  {
    "name": "Keto Diet",
    "image": "keto-diet.jpg",
    "summary": "The Ketogenic (Keto) Diet is a high-fat, low-carbohydrate eating plan designed to shift the body's metabolism from using glucose to using fat, inducing a state called ketosis. This process promotes fat burning and can lead to weight loss. Keto emphasizes foods like fatty fish, meats, cheese, and low-carb vegetables while avoiding grains, sugar, and most fruits. Originally used to treat epilepsy, it gained popularity as a rapid weight-loss strategy. Though effective for some, it requires careful planning to maintain nutritional balance.",
    "peak_search_trend": "2019-01",
    "main_foods": [
      "Avocados",
      "Cheese",
      "Eggs",
      "Fatty fish",
      "Nuts",
      "Seeds",
      "Olive oil",
      "Leafy greens",
      "Meat"
    ],
    "filter_value": "Keto Diet"
  },
  {
    "name": "Low Fat Diet",
    "image": "low-fat-diet.jpg",
    "summary": "A Low Fat Diet focuses on reducing the intake of dietary fats, particularly saturated and trans fats, to promote heart health and aid in weight management. It emphasizes the consumption of fruits, vegetables, whole grains, and lean proteins. Low-fat or fat-free dairy products are encouraged, and high-fat processed foods are avoided. While effective for cholesterol control, the diet can lack essential fats if not balanced properly. It remains a popular and well-researched option for overall health improvement.",
    "peak_search_trend": "2004-01",
    "main_foods": [
      "Fruits",
      "Vegetables",
      "Whole grains",
      "Lean meat",
      "White fish",
      "Low-fat dairy",
      "Legumes"
    ],
    "filter_value": "Low Fat Diet"
  },
  {
    "name": "Master Cleanse",
    "image": "master-cleanse.jpg",
    "summary": "The Master Cleanse, also known as the Lemonade Diet, is a liquid detox diet created by Stanley Burroughs in the 1940s. It involves consuming a mixture of lemon juice, maple syrup, cayenne pepper, and water for 10 days, while avoiding all solid foods. Proponents claim it helps cleanse the body and promote weight loss. However, nutritionists warn that it is nutritionally deficient and may lead to muscle loss, fatigue, and other health issues if followed for extended periods. It’s generally considered a crash diet.",
    "peak_search_trend": "2013-01",
    "main_foods": [
      "Lemon juice",
      "Maple syrup",
      "Cayenne pepper",
      "Water"
    ],
    "filter_value": "Master Cleanse"
  },
  {
    "name": "Paleo Diet",
    "image": "paleo-diet.jpeg",
    "summary": "The Paleo Diet, also known as the Caveman Diet, is based on the idea of eating like our pre-agricultural ancestors. It promotes whole, unprocessed foods such as meats, fish, fruits, vegetables, nuts, and seeds, while eliminating grains, dairy, legumes, and processed foods. Advocates believe it improves digestion, energy, and weight management. Critics argue that its exclusion of entire food groups may lead to nutritional gaps. Nonetheless, it has become popular for its simplicity and whole-food emphasis.",
    "peak_search_trend": "2014-01",
    "main_foods": [
      "Lean meats",
      "Fish",
      "Fruits",
      "Vegetables",
      "Nuts",
      "Seeds"
    ],
    "filter_value": "Paleo Diet"
  },
  {
    "name": "Special K Diet",
    "image": "special-k-diet.jpg",
    "summary": "The Special K Diet is a short-term weight loss plan promoted by the cereal brand. It involves replacing two daily meals with Special K cereal or bars and eating a sensible third meal. Snacks are limited to fruits and vegetables, aiming to reduce overall calorie intake. The diet is convenient and portion-controlled but often criticized for relying on processed foods. It’s marketed as a way to lose weight quickly, usually over two weeks, with mixed long-term success.",
    "peak_search_trend": "2010-01",
    "main_foods": [
      "Special K cereal",
      "Low-fat milk",
      "Fruits",
      "Vegetables",
      "Lean protein"
    ],
    "filter_value": "Special K"
  },
  {
    "name": "Whole30",
    "image": "whole30.jpeg",
    "summary": "Whole30 is a 30-day elimination diet that focuses on whole, unprocessed foods while eliminating sugar, alcohol, grains, legumes, soy, and dairy. The goal is to reset your metabolism, identify food sensitivities, and improve your relationship with food. After 30 days, foods are reintroduced one at a time to assess their impact. Whole30 is strict and requires discipline, but many participants report increased energy, better digestion, and weight loss. Critics cite its restrictiveness and lack of long-term guidance.",
    "peak_search_trend": "2018-01",
    "main_foods": [
      "Meat",
      "Seafood",
      "Eggs",
      "Vegetables",
      "Fruits",
      "Natural fats"
    ],
    "filter_value": "Whole 30"
  },
  {
    "name": "Zone Diet",
    "image": "zone-diet.jpeg",
    "summary": "The Zone Diet, developed by Dr. Barry Sears, aims to reduce inflammation and promote fat loss by balancing macronutrients in a 40:30:30 ratio of carbohydrates, protein, and fat. It encourages lean meats, fruits, vegetables, and healthy fats in controlled portions. Meals are designed to keep insulin levels stable and support hormonal balance. While some see success with this structured plan, others find the required precision difficult to maintain. It remains popular for its emphasis on balance and portion control.",
    "peak_search_trend": "2004-05",
    "main_foods": [
      "Lean meats",
      "Fruits",
      "Vegetables",
      "Nuts",
      "Olive oil"
    ],
    "filter_value": "Zone Diet"
  }
]